<a href="https://colab.research.google.com/github/19PA1A0236/AI-lab/blob/master/EXPERIMENT_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# EXPERIMENT-2

# Pandas

In [1]:
import pandas as pd
import numpy as np

## 1)Create a dataframe manually.

In [2]:
df=pd.DataFrame({"Roll No":["EEE203","EEE236","EEE244"],"Name":["Ä.Prasanna","G.Vineetha","K.Poojitha"]})
df

  Roll No        Name
0  EEE203  Ä.Prasanna
1  EEE236  G.Vineetha
2  EEE244  K.Poojitha

## 2)Import data into a dataframe

In [7]:
df=pd.read_csv("students_placement_data.csv")
df

     Roll No Gender  ... registered_for_ Placement_Training  placement status
0          1      M  ...                                 NO        Not placed
1          2      F  ...                                yes            Placed
2          3      F  ...                                yes        Not placed
3          4      M  ...                                yes        Not placed
4          5      M  ...                                yes        Not placed
..       ...    ...  ...                                ...               ...
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[117 rows x 9 columns]

## 3)Adding, Deleting, Modifying the rows/columns in a dataframe.

### 3.1)Adding a column

In [9]:
host_day=pd.read_csv("hostlers_day_scholars.csv")
host_day.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [10]:
df["hostlers/days scholar"]=host_day.values
df.head()

   Roll No Gender  ... placement status  hostlers/days scholar
0        1      M  ...       Not placed                      d
1        2      F  ...           Placed                      d
2        3      F  ...       Not placed                      d
3        4      M  ...       Not placed                      d
4        5      M  ...       Not placed                      h

[5 rows x 10 columns]

### 3.2)Deleting a column

In [15]:
del df["registered_for_ Placement_Training"] 
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
0        1      M       A  ...        18        Not placed                      d
1        2      F       A  ...         0            Placed                      d
2        3      F       A  ...        13        Not placed                      d
3        4      M       A  ...        17        Not placed                      d
4        5      M       A  ...        17        Not placed                      h

[5 rows x 9 columns]

### 3.3)Adding a row

In [16]:
df1=pd.DataFrame({"Roll No": [118],"Gender": ["F"],"Section": ["C"],"SSC Percentage": [98.4],"inter-Diplomo_percentage": [99],"B.Tech_percentage": [75],"Backlogs": [0],"placement status": ["Not placed"],"hostlers/days scholar": ["h"]},index=[117])
df1

     Roll No Gender Section  ...  Backlogs  placement status  hostlers/days scholar
117      118      F       C  ...         0        Not placed                      h

[1 rows x 9 columns]

In [17]:
df=df.append(df1)
df.head()

   Roll No Gender  ... hostlers/days scholar  inter-Diplomo_percentage
0        1      M  ...                     d                       NaN
1        2      F  ...                     d                       NaN
2        3      F  ...                     d                       NaN
3        4      M  ...                     d                       NaN
4        5      M  ...                     h                       NaN

[5 rows x 10 columns]

### 3.4)Deleting a row

In [18]:
df=df.drop(3)
df.head()

   Roll No Gender  ... hostlers/days scholar  inter-Diplomo_percentage
0        1      M  ...                     d                       NaN
1        2      F  ...                     d                       NaN
2        3      F  ...                     d                       NaN
4        5      M  ...                     h                       NaN
5        6      M  ...                     h                       NaN

[5 rows x 10 columns]

### 3.5) Modifying elements

In [19]:
df.loc[1,"hostlers/days scholar"]="h"
df.head()

   Roll No Gender  ... hostlers/days scholar  inter-Diplomo_percentage
0        1      M  ...                     d                       NaN
1        2      F  ...                     h                       NaN
2        3      F  ...                     d                       NaN
4        5      M  ...                     h                       NaN
5        6      M  ...                     h                       NaN

[5 rows x 10 columns]

## 4) Applying functions on a dataframe.

In [21]:
def gp(y):
  if(y<70):
    return(y+0.05)
  else:
    return(y)

In [22]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(gp)
df.head()

   Roll No Gender  ... hostlers/days scholar  inter-Diplomo_percentage
0        1      M  ...                     d                       NaN
1        2      F  ...                     h                       NaN
2        3      F  ...                     d                       NaN
4        5      M  ...                     h                       NaN
5        6      M  ...                     h                       NaN

[5 rows x 10 columns]

## 5) Iterations on dataframe

In [23]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

## 6) Accessing the elements from a dataframe

In [24]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

## 7) Different ways to deal with NA’s in dataframe

In [25]:
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... hostlers/days scholar  inter-Diplomo_percentage
0        1      M  ...                     d                       NaN
1        2      F  ...                     h                       NaN
2        3      F  ...                     d                       NaN
4        5      M  ...                     h                       NaN
5        6      M  ...                     h                       NaN

[5 rows x 10 columns]

## 8) Groupby operations on dataframe

In [26]:
group=df.groupby("Gender")
group["B.Tech_percentage"].agg(np.mean)

Gender
F    71.292400
M    57.343881
Name: B.Tech_percentage, dtype: float64

## 9) Merging the dataframes

In [27]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [28]:
df=pd.merge(df,df2,on="Roll No")
df.head()

   Roll No Gender  ... inter-Diplomo_percentage  Urban/Rural
0        1      M  ...                      NaN        Urban
1        2      F  ...                      NaN        Rural
2        3      F  ...                      NaN        Urban
3        5      M  ...                      NaN        Urban
4        6      M  ...                      NaN        Rural

[5 rows x 11 columns]